## [DataFrame 인덱스 다루기]

- (1) 모듈 로딩 <hr>

In [52]:
import pandas as pd

- (2) 데이터 준비 <hr>

In [53]:
exam={ '이름':['마징가', '베트맨', '홍길동', '임꺽정'],
      '국어':[98, 79, 99, 100],
      '미술':[70, 99, 87, 80],
      '수학':[46, 85, 89, 60],
      '체육':[80, 88, 75, 100]}

- (3) 데이터 저장

In [54]:
examDF=pd.DataFrame(exam)

- (4) 데이터 확인

In [55]:
examDF

    이름   국어  미술  수학   체육
0  마징가   98  70  46   80
1  베트맨   79  99  85   88
2  홍길동   99  87  89   75
3  임꺽정  100  80  60  100

- (5) 새로운 인덱스 설정 - 방법1 : 인덱스 일부 변경 DF.rename()

In [56]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
examDF.rename(index={0:'zero'})   # 원본에 영향을 안준다.

       이름   국어  미술  수학   체육
zero  마징가   98  70  46   80
1     베트맨   79  99  85   88
2     홍길동   99  87  89   75
3     임꺽정  100  80  60  100

In [57]:
examDF

    이름   국어  미술  수학   체육
0  마징가   98  70  46   80
1  베트맨   79  99  85   88
2  홍길동   99  87  89   75
3  임꺽정  100  80  60  100

In [58]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame에 변경여부 결정, 기본은 원본 변경 안함 False!!!
examDF.rename(index={0:'zero'}, inplace=True)

In [59]:
examDF

       이름   국어  미술  수학   체육
zero  마징가   98  70  46   80
1     베트맨   79  99  85   88
2     홍길동   99  87  89   75
3     임꺽정  100  80  60  100

In [60]:
# 열 이름 인덱스 일부 변경 => column={기존인덱스:새로운인덱스}
examDF.rename(columns={'체육':'음악'}, inplace=True)

In [61]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '음악'], dtype='object')

- (5) 새로운 인덱스 설정 - 방법2: 특정 컬럼 => 인덱스 : DF.set_index()

In [62]:
# 현재 기본 0 ~ ==> 이름 컬럼 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [63]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라메터가 False로 원본에 적용 안됨!
examDF2 = examDF.set_index('이름')
examDF2.index

Index(['마징가', '베트맨', '홍길동', '임꺽정'], dtype='object', name='이름')

In [64]:
examDF2.loc['마징가']

국어    98
미술    70
수학    46
음악    80
Name: 마징가, dtype: int64

In [65]:
# 2개의 컬럼을 행 인덱스 설정 단, inplace 파라메터가 False로 원본에 적용 안됨!
examDF3 = examDF.set_index(['이름','국어','수학'])
examDF3.index

MultiIndex([('마징가',  98, 46),
            ('베트맨',  79, 85),
            ('홍길동',  99, 89),
            ('임꺽정', 100, 60)],
           names=['이름', '국어', '수학'])

In [66]:
examDF3.loc[('마징가',98,46)]

미술    70
음악    80
Name: (마징가, 98, 46), dtype: int64

In [67]:
examDF3.loc[('마징가',98)]

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_2696\3044410823.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF3.loc[('마징가',98)]

    미술  음악
수학
46  70  80

In [68]:
# keyError => '마징가', 98, 46 형식으로 98로 시작하는 key 없음
# examDF3.loc[(98,46)]

- (5) 새로운 인덱스 설정 방법 3:

In [69]:
examDF.set_index('이름', inplace=True)

In [70]:
examDF

      국어  미술  수학   음악
이름
마징가   98  70  46   80
베트맨   79  99  85   88
홍길동   99  87  89   75
임꺽정  100  80  60  100

In [71]:
# 현재 행 인덱스 ===> 컬럼으로 추가 ==> 원본으로 돌아가는 느낌(실제 원본은 아님)
examDF.reset_index()

    이름   국어  미술  수학   음악
0  마징가   98  70  46   80
1  베트맨   79  99  85   88
2  홍길동   99  87  89   75
3  임꺽정  100  80  60  100

In [77]:
examDF

      국어  미술  수학   음악
이름
마징가   98  70  46   80
베트맨   79  99  85   88
홍길동   99  87  89   75
임꺽정  100  80  60  100

In [78]:
# 현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정
df2 = examDF.reset_index(drop=True)
df2

    국어  미술  수학   음악
0   98  70  46   80
1   79  99  85   88
2   99  87  89   75
3  100  80  60  100

In [79]:
examDF.reset_index()

    이름   국어  미술  수학   음악
0  마징가   98  70  46   80
1  베트맨   79  99  85   88
2  홍길동   99  87  89   75
3  임꺽정  100  80  60  100